# Напишите программу, в которой пользователь будет задавать две строки,
#  а программа - определять количество вхождений одной строки в другой.

str_1 = input('str_1: ')
str_2 = input('str_2: ')
print(str_1.count(str_2))
